-- phpMyAdmin SQL Dump
-- version 4.8.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Мар 05 2019 г., 23:44
-- Версия сервера: 10.1.32-MariaDB
-- Версия PHP: 7.2.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `niklen`
--

-- --------------------------------------------------------

--
-- Структура таблицы `bags`
--

CREATE TABLE `bags` (
  `id` int(11) NOT NULL,
  `Размер, см.` varchar(11) NOT NULL,
  `Цена за 1 шт. с НДС из ткани джутовой 380гр/м2` decimal(10,2) NOT NULL,
  `Цена за 1 шт. с НДС из парусины хб/лен 380гр/м2` decimal(10,2) NOT NULL,
  `Цена за 1 шт. с НДС из брезента ОП и СКПВ 480гр/м2` decimal(10,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `bags`
--

INSERT INTO `bags` (`id`, `Размер, см.`, `Цена за 1 шт. с НДС из ткани джутовой 380гр/м2`, `Цена за 1 шт. с НДС из парусины хб/лен 380гр/м2`, `Цена за 1 шт. с НДС из брезента ОП и СКПВ 480гр/м2`) VALUES
(1, '10х15', '20.00', '22.00', '25.00'),
(2, '15х20', '25.00', '30.00', '30.00'),
(3, '20х30', '35.00', '40.00', '45.00'),
(4, '30х40', '42.00', '52.00', '57.00'),
(5, '40х50', '55.00', '59.00', '65.00'),
(6, '40х60', '61.00', '65.00', '65.00'),
(7, '40х80', '73.00', '78.00', '87.00'),
(8, '50х80', '90.00', '97.00', '109.00'),
(9, '60х80', '97.00', '104.00', '117.00'),
(10, '56х96', '90.00', '90.00', '113.00'),
(11, '53х104', '90.00', '107.00', '121.00'),
(12, '80х110', '126.00', '150.00', '170.00'),
(13, '80х120', '132.00', '189.00', '215.00');

-- --------------------------------------------------------

--
-- Структура таблицы `curtains`
--

CREATE TABLE `curtains` (
  `id` int(11) NOT NULL,
  `Наименование продукции` varchar(64) NOT NULL,
  `Размер м2` varchar(32) DEFAULT NULL,
  `Плотность гр/м2` varchar(32) NOT NULL,
  `Цена с НДС за 1 шт.` decimal(11,2) NOT NULL,
  `Цена с НДС за 1 шт. От 50 шт.` decimal(11,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `curtains`
--

INSERT INTO `curtains` (`id`, `Наименование продукции`, `Размер м2`, `Плотность гр/м2`, `Цена с НДС за 1 шт.`, `Цена с НДС за 1 шт. От 50 шт.`) VALUES
(1, 'Полог брезентовый ОП', 'От 8м2', '480 гр/м2', '160.00', '140.00'),
(2, 'Полог брезентовый ОП', 'От 8м2', '480 гр/м2', '130.00', '120.00'),
(3, 'Полог брезентовый ОП', 'До 8 м2', '520-620 гр/м2', '290.00', '270.00'),
(4, 'Полог брезентовый ОП', 'От 8м2', '520-620 гр/м2', '230.00', '210.00'),
(5, 'Полог брезентовый ОП утепленный', NULL, '480 гр/м2', '290.00', '270.00'),
(6, 'Полог брезентовый СКПВ', 'До 8м2', '480 гр/м2', '160.00', '140.00'),
(7, 'Полог брезентовый СКПВ', 'От 8м2', '480 гр/м2', '130.00', '120.00'),
(8, 'Полог брезентовый СКПВ', 'До 8 м2', '520-620 гр/м2', '290.00', '270.00'),
(9, 'Полог брезентовый СКПВ', 'От 8м2', '520-620 гр/м2', '230.00', '210.00'),
(10, 'Полог брезентовый СКПВ утепленный', NULL, '480 гр/м2', '300.00', '290.00');

-- --------------------------------------------------------

--
-- Структура таблицы `packing`
--

CREATE TABLE `packing` (
  `id` int(11) NOT NULL,
  `Наименование продукции` varchar(32) NOT NULL,
  `Ширина ткани, см.` int(16) NOT NULL DEFAULT '110',
  `Поверхностная плотность` varchar(16) NOT NULL,
  `Число нитей на 10 см` varchar(8) DEFAULT NULL,
  `Цена с НДС за 1 п.м. Состав: 100% лен` decimal(10,2) DEFAULT NULL,
  `Цена с НДС за 1 п.м. Состав: 100% джут` decimal(10,2) DEFAULT NULL,
  `Цена с НДС за 1 п.м. Состав: 50% лен,50% джут` decimal(10,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `packing`
--

INSERT INTO `packing` (`id`, `Наименование продукции`, `Ширина ткани, см.`, `Поверхностная плотность`, `Число нитей на 10 см`, `Цена с НДС за 1 п.м. Состав: 100% лен`, `Цена с НДС за 1 п.м. Состав: 100% джут`, `Цена с НДС за 1 п.м. Состав: 50% лен,50% джут`) VALUES
(1, 'Ткань упаковочная арт. 14133', 110, '160-+10', '22/25', NULL, '31.50', NULL),
(2, 'Ткань упаковочная арт. 14133', 95, '190-+20', '33/25', '36.70', '31.10', '31.10'),
(3, 'Ткань упаковочная арт. 14133', 110, '190+-20', '33/25', '43.90', '36.90', '39.50'),
(4, 'Ткань упаковочная арт. 14133', 110, '210+-10', '34/32', '51.00', '51.00', '46.70'),
(5, 'Ткань упаковочная арт. 14133', 110, '240+-20', '46/30', '58.80', '49.20', '52.80'),
(6, 'Ткань упаковочная арт. 14133', 110, '270+-20', '46/40', '66.90', '55.90', '60.90'),
(7, 'Ткань упаковочная арт. 14133', 106, '320+-20', '46/54', '77.40', '77.40', '71.60'),
(8, 'Ткань мешочная арт.151-106/8-91', 106, '360+-20', '49/60', '88.10', '73.70', '79.00'),
(9, 'Ткань мешочная 151-106/8-91', 106, '420+-25', '69/63', '99.10', '82.50', '82.50'),
(10, 'Ткань мешочная джутовая ламиниро', 106, '380+-20', '49/60', NULL, '120.00', NULL),
(11, 'Ткань 100% ХБ «Хозяюшка»', 90, '170', NULL, NULL, NULL, '36.00'),
(12, 'Ткань 100% ХБ Серпянка', 110, '183', NULL, NULL, NULL, '65.00');

-- --------------------------------------------------------

--
-- Структура таблицы `sailcloth`
--

CREATE TABLE `sailcloth` (
  `id` int(11) NOT NULL,
  `Наименование продукции` varchar(64) NOT NULL,
  `Ширина, см` int(11) NOT NULL DEFAULT '92',
  `Плотность, гр/м2` varchar(16) NOT NULL,
  `Число нитей на 10 см.` varchar(16) NOT NULL,
  `Цена с НДС за 1 п.м.` decimal(10,2) NOT NULL,
  `Цена с НДС за 1 п.м. от 5000 п.м.` decimal(10,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `sailcloth`
--

INSERT INTO `sailcloth` (`id`, `Наименование продукции`, `Ширина, см`, `Плотность, гр/м2`, `Число нитей на 10 см.`, `Цена с НДС за 1 п.м.`, `Цена с НДС за 1 п.м. от 5000 п.м.`) VALUES
(1, 'Парусина полульняная суровая\r\nОснова-хлопок, уток – лен.', 92, '335+-15', '214/63', '60.00', '58.50'),
(2, 'Парусина полульняная суровая\r\nОснова-хлопок, уток-джут', 92, '315+-15', '214/63', '53.00', '52.00'),
(3, 'Парусина полульняная суровая\r\nОснова-хлопок, уток – лен.', 92, '365+-20', '214/70', '64.00', '62.50'),
(4, 'Парусина полульняная суровая\r\nОснова-хлопок, уток – джут', 92, '365+-20', '214/70', '56.50', '55.00'),
(5, 'Парусина полульняная суровая\r\nОснова-хлопок, уток – лен.', 92, '385+-20', '280/66', '68.00', '66.50'),
(6, 'Парусина полульняная суровая\r\nОснова-хлопок, уток-джут', 92, '385+-20', '280/66', '61.00', '59.50'),
(7, 'Парусина полульняная суровая\r\nОснова-хлопок, уток – лен.', 92, '440+-25', '280/83', '75.00', '73.50'),
(8, 'Парусина полульняная суровая\r\nОснова-хлопок, уток-джут', 92, '440+-25', '280/83', '66.50', '65.00'),
(9, 'Парусина полульняная суровая\r\nОснова-хлопок, уток – лен', 92, '465+-20', '368/70', '79.00', '77.50'),
(10, 'Парусина полульняная суровая\r\nОснова-хлопок, уток – джут.', 92, '445+-20', '368/70', '71.50', '70.00'),
(11, 'Парусина полульняная суровая\r\nОснова-хлопок, уток-лен', 92, '575+-30', '280/70', '95.00', '93.00');

-- --------------------------------------------------------

--
-- Структура таблицы `tarpaulin`
--

CREATE TABLE `tarpaulin` (
  `id` int(11) NOT NULL,
  `Наименование` varchar(64) NOT NULL,
  `Ширина, см` int(11) NOT NULL DEFAULT '90',
  `Плотность, гр/м2` varchar(8) NOT NULL,
  `Цена с НДС за 1 п.м.` decimal(10,2) NOT NULL,
  `Цена с НДС за 1 п.м. От 5000 п.м.` decimal(10,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `tarpaulin`
--

INSERT INTO `tarpaulin` (`id`, `Наименование`, `Ширина, см`, `Плотность, гр/м2`, `Цена с НДС за 1 п.м.`, `Цена с НДС за 1 п.м. От 5000 п.м.`) VALUES
(1, 'Брезент ОП арт. 11235 (хб/лен)', 90, '400+-20', '65.00', '61.00'),
(2, 'Брезент ОП арт. 11235 (хб/джут)', 90, '400+-20', '61.50', '60.00'),
(3, 'Брезент ОП арт. 11255 (хб/лен)', 90, '460+-30', '69.00', '67.00'),
(4, 'Брезент ОП арт. 11255 (хб/джут)', 90, '460+-30', '64.00', '62.50'),
(5, 'Брезент ОП арт. 11293 (хб/лен)', 90, '480+-30', '74.00', '72.50'),
(6, 'Брезент ОП арт. 11293 (хб/джут)', 90, '480+-30', '68.00', '65.60'),
(7, 'Брезент ОП арт.11292 (хб/лен)', 90, '520+-30', '83.00', '81.00'),
(8, 'Брезент ОП арт.11292 (хб/джут)', 90, '520+-30', '75.00', '73.80'),
(9, 'Брезент ОП арт. 11252 (хб/лен)', 90, '620+-30', '132.00', '130.00'),
(10, 'Брезент СКПВ арт. 11255 (хб/лен)', 90, '390+-20', '83.00', '82.80'),
(11, 'Брезент СКПВ арт. 11255 (хб/джут)', 90, '390+-20', '73.00', '71.00'),
(12, 'Брезент СКПВ арт. 11293 (хб/лен)', 90, '460+-20', '86.00', '85.00'),
(13, 'Брезент СКПВ арт. 11293 (хб/джут)', 90, '460+-20', '78.00', '77.50'),
(14, 'Брезент СКПВ арт. 11292(хб/лен', 90, '550+-20', '105.00', '102.00'),
(15, 'Брезент СКПВ арт. 11252(хб/лен)', 90, '575+-20', '136.00', '132.00');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `bags`
--
ALTER TABLE `bags`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `curtains`
--
ALTER TABLE `curtains`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `packing`
--
ALTER TABLE `packing`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `sailcloth`
--
ALTER TABLE `sailcloth`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `tarpaulin`
--
ALTER TABLE `tarpaulin`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `bags`
--
ALTER TABLE `bags`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT для таблицы `curtains`
--
ALTER TABLE `curtains`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT для таблицы `packing`
--
ALTER TABLE `packing`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT для таблицы `sailcloth`
--
ALTER TABLE `sailcloth`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT для таблицы `tarpaulin`
--
ALTER TABLE `tarpaulin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
